title: ModSecurity - file extension
id: 7bbe0398-610e-4187-8f0f-6b04d58c9289
status: test
description: 'Triggers when an OCSF “Application Security Alert” (class_uid 6008) contains ModSecurity Core Rule Set ID 920440, detecting access attempts to restricted or potentially sensitive file extensions in the URI.'
author: logrr
date: 2025-06-25
logsource:
  product: ocsf
  category: application
detection:
  waf_alert:
    class_uid: 6008
  sel_extension_rule:
    message|contains: 'id "920440"'
  condition: waf_alert and sel_extension_rule
falsepositives:
  - 모의 침투 테스트
  - 버그바운티
level: high
tags: 
  - attack.t1190
  - owasp.crs
  - attack.initial_access
  - web.waf
  - ocsf.application_security_alert
